let numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0];
let letters = ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "a", "s", "d", "f", "g", "h", "j", "k", "l", "<i class='fas fa-angle-up'></i> <span class='dot'></span>", "z", "x", "c", "v", "b", "n", "m", "<i class='fas fa-backspace'></i>", "#!1", ",", "Space", ".", "<i class='fas fa-level-down-alt fa-rotate-90'></i>"];

let numbersIds = ["num-1", "num-2", "num-3", "num-4", "num-5", "num-6", "num-7", "num-8", "num-9", "num-0"];
let letterIds = ["letter-q", "letter-w", "letter-e", "letter-r", "letter-t", "letter-y", "letter-u", "letter-i", "letter-o", "letter-p", "letter-a", "letter-s", "letter-d", "letter-f", "letter-g", "letter-h", "letter-j", "letter-k", "letter-l", "btn-capslock", "letter-z", "letter-x", "letter-c", "letter-v", "letter-b", "letter-n", "letter-m", "btn-backspace", "btn-symbols", "comma", "spaceBar", "period", "btn-enter"];

const vowels = ["a", "e", "i", "o", "u", "A", "E", "I", "O", "U"];
let engMap = {"q" : "q", "w" : "w", "e" : "e", "r" : "r", "t" : "t", "y" : "y", "u" : "u", "i" : "i", "o" : "o", "p" : "p", "a" : "a", "s" : "s", "d" : "d", "f" : "f", "g" : "g", "h" : "h", "j" : "j", "k" : "k", "l" : "l", "z" : "z", "x" : "x", "c" : "c", "v" : "v", "b" : "b", "n" : "n", "m" : "m",
"Q" : "Q", "W" : "W", "E" : "E", "R" : "R", "T" : "T", "Y" : "Y", "U" : "U", "I" : "I", "O" : "O", "P" : "P", "A" : "A", "S" : "S", "D" : "D", "F" : "F", "G" : "G", "H" : "H", "J" : "J", "K" : "K", "L" : "L", "Z" : "Z", "X" : "X", "C" : "C", "V" : "V", "B" : "B", "N" : "N", "M" : "M", "Space" : " ", "space" : " ",
"1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "0": "0", "," : ",", "." : "."}

const map = {
    'he': 'ሀ', 'hu': 'ሁ', 'hi': 'ሂ', 'ha': 'ሃ', 'hie': 'ሄ', 'h': 'ህ', 'ho': 'ሆ', 
    'le': 'ለ', 'lu': 'ሉ', 'li': 'ሊ', 'la': 'ላ', 'lie': 'ሌ', 'l': 'ል', 'lo': 'ሎ', 
    'He': 'ሐ', 'Hu': 'ሑ', 'Hi': 'ሒ', 'Ha': 'ሓ', 'Hie': 'ሔ', 'H': 'ሕ', 'Ho': 'ሖ',
    'me': 'መ','mu': 'ሙ','mi': 'ሚ','ma': 'ማ','mie': 'ሜ','m': 'ም','mo': 'ሞ',
    's2e': 'ሠ','s2u': 'ሡ','s2i': 'ሢ','s2a': 'ሣ','s2ie': 'ሤ','s2': 'ሥ','s2o': 'ሦ',
    're': 'ረ','ru': 'ሩ','ri': 'ሪ','ra': 'ራ','rie': 'ሬ','r': 'ር','ro': 'ሮ',
    'se': 'ሰ','su': 'ሱ','si': 'ሲ','sa': 'ሳ','sie': 'ሴ','s': 'ስ','so': 'ሶ',
    'Se': 'ሸ','Su': 'ሹ','Si': 'ሺ','Sa': 'ሻ','Sie': 'ሼ','S': 'ሽ','So': 'ሾ',
    'Se': 'ሸ','Su': 'ሹ','Si': 'ሺ','Sa': 'ሻ','Sie': 'ሼ','S': 'ሽ','So': 'ሾ',
    'qe': 'ቀ','qu': 'ቁ','qi': 'ቂ','qa': 'ቃ','qie': 'ቄ','q': 'ቅ','qo': 'ቆ',
    'Qe': 'ቐ','Qu': 'ቑ','Qi': 'ቒ','Qa': 'ቓ','Qie': 'ቔ','Q': 'ቕ','Qo': 'ቖ',
    'be': 'በ','bu': 'ቡ','bi': 'ቢ','ba': 'ባ','bie': 'ቤ','b': 'ብ','bo': 'ቦ',
    'te': 'ተ','tu': 'ቱ','ti': 'ቲ','ta': 'ታ','tie': 'ቴ','t': 'ት','to': 'ቶ',
    'ce': 'ቸ','cu': 'ቹ','ci': 'ቺ','ca': 'ቻ','cie': 'ቼ','c': 'ች','co': 'ቾ',
    'ne': 'ነ','nu': 'ኑ','ni': 'ኒ','na': 'ና','nie': 'ኔ','n': 'ን','no': 'ኖ',
    'Ne': 'ኘ','Nu': 'ኙ','Ni': 'ኚ','Na': 'ኛ','Nie': 'ኜ','N': 'ኝ','No': 'ኞ',
    'e': 'አ','u': 'ኡ','i': 'ኢ','a': 'ኣ','ie': 'ኤ','ee': 'እ','o': 'ኦ',
    'ke': 'ከ','ku': 'ኩ','ki': 'ኪ','ka': 'ካ','kie': 'ኬ','k': 'ክ','ko': 'ኮ',
    'Ke': 'ኸ','Ku': 'ኹ','Ki': 'ኺ','Ka': 'ኻ','Kie': 'ኼ','K': 'ኽ','Ko': 'ኾ',
    'we': 'ወ','wu': 'ዉ','wi': 'ዊ','wa': 'ዋ','wie': 'ዌ','w': 'ው','wo': 'ዎ',
    'E': 'ዐ','U': 'ዑ','I': 'ዒ','A': 'ዓ','IE': 'ዔ','Ee': 'ዕ','O': 'ዖ',
    'ze': 'ዘ','zu': 'ዙ','zi': 'ዚ','za': 'ዛ','zie': 'ዜ','z': 'ዝ','zo': 'ዞ',
    'Ze': 'ዠ','Zu': 'ዡ','Zi': 'ዢ','Za': 'ዣ','Zie': 'ዤ','Z': 'ዥ','Zo': 'ዦ',
    'ye': 'የ','yu': 'ዩ','yi': 'ዪ','ya': 'ያ','yie': 'ዬ','y': 'ይ','yo': 'ዮ',
    'de': 'ደ','du': 'ዱ','di': 'ዲ','da': 'ዳ','die': 'ዴ','d': 'ድ','do': 'ዶ',
    'je': 'ጀ','ju': 'ጁ','ji': 'ጂ','ja': 'ጃ','jie': 'ጄ','j': 'ጅ','jo': 'ጆ',
    'ge': 'ገ','gu': 'ጉ','gi': 'ጊ','ga': 'ጋ','gie': 'ጌ','g': 'ግ','go': 'ጎ',
    'Te': 'ጠ','Tu': 'ጡ','Ti': 'ጢ','Ta': 'ጣ','Tie': 'ጤ','T': 'ጥ','To': 'ጦ',
    'Ce': 'ጨ','Cu': 'ጩ','Ci': 'ጪ','Ca': 'ጫ','Cie': 'ጬ','C': 'ጭ','Co': 'ጮ',
    'Pe': 'ጰ','Pu': 'ጱ','Pi': 'ጲ','Pa': 'ጳ','Pie': 'ጴ','P': 'ጵ','Po': 'ጶ',
    'xe': 'ፀ','xu': 'ፁ','xi': 'ፂ','xa': 'ፃ','xie': 'ፄ','x': 'ፅ','xo': 'ፆ',
    'Xe': 'ጸ','Xu': 'ጹ','Xi': 'ጺ','Xa': 'ጻ','Xie': 'ጼ','X': 'ጽ','Xo': 'ጾ',
    'fe': 'ፈ','fu': 'ፉ','fi': 'ፊ','fa': 'ፋ','fie': 'ፌ','f': 'ፍ','fo': 'ፎ',
    'pe': 'ፐ','pu': 'ፑ','pi': 'ፒ','pa': 'ፓ','pie': 'ፔ','p': 'ፕ','po': 'ፖ',
    've': 'ቨ','vu': 'ቩ','vi': 'ቪ','va': 'ቫ','vie': 'ቬ','v': 'ቭ','vo': 'ቮ',
    'que': 'ቈ','qua': 'ቋ','qui': 'ቊ','Que': 'ቘ','Qua': 'ቛ','Qui': 'ቚ',
    'h2e': 'ኀ','h2u': 'ኁ','h2i': 'ኂ','h2a': 'ኃ','h2ie': 'ኄ','h2': 'ኅ','h2o': 'ኆ',
    'hue': 'ኈ','hua': 'ኋ','hui': 'ኊ',
    'gue': 'ጐ','gua': 'ጓ','gui': 'ጒ',
    'lua': 'ሏ','Hua': 'ሗ','mua': 'ሟ','s2ua': 'ሧ','rua': 'ሯ','sua': 'ሷ','Sua': 'ሿ',
    'qua': 'ቋ','Qua': 'ቛ','bua': 'ቧ','tua': 'ቷ','cua': 'ቿ','nua': 'ኗ','Nua': 'ኟ',
    'ua': 'ኧ','kua': 'ኳ','Kua': 'ዃ','zua': 'ዟ','Zua': 'ዧ','dua': 'ዷ','jua': 'ጇ',
    'Tua': 'ጧ','Cua': 'ጯ','Pua': 'ጷ','Xua': 'ጿ','fua': 'ፏ','pua': 'ፗ','vua': 'ቯ',
    '.': '።',',': '፣',
    "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "0": "0"
}